[{
        "name": "STRONG, BRITISH AND BLACK.",
        "organiser": "ArtsKeele",
        "date": "26 September 2020",
        "time": "10:00am",
        "location": "Keele Art Gallery",
        "summary": "Strong, British and Black is a Kwanzaa Collective UK* exhibition which showcases the art of black and brown women living and working in Staffordshire. Building on the themes of the Cultural Affairs I AM exhibition (2019) this exhibition centres the voices of black and brown women to explore what it means to be Strong, British and Black. Using film, photography, painting, poetry, sculpture and digital art, the artists explore the themes of the exhibition individually, while looking at how they interact. What does it mean to a strong woman? What does it mean to be Strong and Black?  What does it mean to be Black British in a country that often considers you Black in Britain?"
    },
    {

        "name": "THREE COUNTIES OPEN ART CUBES",
        "organiser": "ArtsKeele",
        "date": "24 September 2020",
        "time": "12:00pm",
        "location": "Keele Art Gallery",
        "summary": "Following on from the success of the first virtual Three Counties Open Art exhibition this summer, we now have an exciting opportunity to showcase some of the talented work from the exhibition by artists from Cheshire, Shropshire & Staffordshire. Appetite and ArtsKeele are really excited to be bringing The Three Counties Cubes to life over the coming months. This illuminated exhibition is perfect for the darker days and will see 4 huge cubes take centre stage as they tour from Stoke-on-Trent to Newcastle-under-Lyme and complete their journey at Keele University in the New Year.  The cubes will feature some of the works from the summer show. Run by ArtsKeele the Three Counties Open Art Exhibition has been taking place since the early 2000s and since 2017 has taken place in the historic Burslem School of Art. It is ‘open’ to anyone from Staffordshire, Cheshire and Shropshire to submit a piece of artwork. In spite of the pandemic, The Three Counties team and partners were committed to making it happen in 2020 and the project this year took place virtually with 145 works appearing in the online exhibition in August."
    },
    {
        "name": "KEELE MUSIC FORUM: ‘GRAVITONICITY: TOWARDS A MODEL OF THE 'GRAVITATION' IN MUSIC",
        "organiser": "ArtsKeele",
        "date": "19 November 2020",
        "time": "12:00pm",
        "location": "Keele Art Gallery",
        "summary": "Keele Univeresity's James Shufflebotham presents ‘Gravitonicity: towards a Model of the 'Gravitation' in Music as part of the Keele Music Forum series. Zoom log in details are: Join Zoom Meeting https://zoom.us/j/93536660044?pwd=Mld4NkQ2TWx5V3FIQ2NVcTk2d05wQT09 Meeting ID: 935 3666 0044Passcode: 908300"
    },
    {
        "name": "SALVAGED SHARDS INTO SCULPTURAL ARCHAEOLOGICAL MOSAICS",
        "organiser": "ArtsKeele",
        "date": "24 September 2020",
        "time": "12:00pm",
        "location": "Keele Art Gallery",
        "summary": "Philip Hardaker has been producing art for over 40 years. Working with over 50,000 people in education, community and the environment as well as completing many public and private commissions. Born in Harrogate North Yorkshire, he graduated from North Staffordshire University Fine Art Sculpture department in 1977. He then went on to the RCA (Royal College of Art) in London where he gained an MA in fine art ceramics. His tutors included the sculptor Sir Eduardo Paolozzi, the painter Sir Peter Blake and ProfessorF David Queensbury. These great tutors had a strong influence on the artists ambitions and intentions. "
    },
    {
        "name": "SARAH DAVIDSON",
        "organiser": "ArtsKeele",
        "date": "19 November 2020",
        "time": "12:00pm",
        "location": "Keele Art Gallery",
        "summary": "We are delighted to welcome Sarah Davidson, Chief Executive Officer of The Carnegie UK Trust for this Grand Challenges lecture.Full details of the lecture will be advised soon. "


    }
]